huanglilong/esp32p4_monitor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_INCLUDE_xTaskGetIdleTaskHandle=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360

# LVGL
CONFIG_LV_USE_CLIB_MALLOC=y
# Detect task continuously runs NPU inference on core 0 — IDLE0 will never run.
# Disable IDLE watchdog to avoid false-positive task_wdt messages.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# LVGL logging disabled — printf blocks the renderer (causes task_wdt)
# CONFIG_LV_USE_LOG is not set
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set
# Fonts: only enable sizes actually used (saves ~560KB Flash vs enabling all 18)
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_SNAPSHOT=y

# BSP
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_BSP_LCD_TYPE_720_720_4_INCH=y
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=1
CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH=1
CONFIG_BSP_I2C_NUM=0
CONFIG_BSP_I2C_CLK_SPEED_HZ=400000

# Camera
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X800_50FPS=y
CONFIG_CAMERA_OV5647_MIPI_IF_FORMAT_INDEX_DEFAULT=2
CONFIG_CAM_CTRL_SPI_ENABLE=n

# COCO Detect Model (YOLO11n 320x320 for P4)
# The 640x640 default model is too slow for real-time, disable it
# CONFIG_FLASH_COCO_DETECT_YOLO11N_S8_V1 is not set
CONFIG_FLASH_COCO_DETECT_YOLO11N_320_S8_V1=y
# CONFIG_COCO_DETECT_YOLO11N_S8_V1 is not set
CONFIG_COCO_DETECT_YOLO11N_320_S8_V1=y
CONFIG_DEFAULT_COCO_DETECT_MODEL=1
CONFIG_COCO_DETECT_MODEL_IN_FLASH_RODATA=y
CONFIG_COCO_DETECT_MODEL_LOCATION=0

# SNTP — sync wall-clock time after WiFi connects (needed for ULog date-based naming)
CONFIG_LWIP_SNTP_MAX_SERVERS=1
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000
CONFIG_LWIP_SNTP_STARTUP_DELAY=y
CONFIG_LWIP_SNTP_MAXIMUM_STARTUP_DELAY=5000

# FATFS
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096

# Increase VFS table size — SD card (fatfs) + camera ISP + MIPI CSI need > 8 entries
CONFIG_VFS_MAX_COUNT=16

# Audio
CONFIG_EXAMPLE_VOICE_VOLUME=100
CONFIG_EXAMPLE_I2C_SCL_IO=8
CONFIG_EXAMPLE_I2C_SDA_IO=7
CONFIG_EXAMPLE_I2S_MCLK_IO=13
CONFIG_EXAMPLE_I2S_BCLK_IO=12
CONFIG_EXAMPLE_I2S_WS_IO=10
CONFIG_EXAMPLE_I2S_DOUT_IO=9
CONFIG_EXAMPLE_I2S_DIN_IO=11

# Audio Simple Player - output format conversions (match ES8311: 16-bit stereo 48kHz)
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_BIT_CVT_EN=y
CONFIG_AUDIO_SIMPLE_PLAYER_BIT_CVT_DEST_16BIT=y
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_CH_CVT_EN=y
CONFIG_AUDIO_SIMPLE_PLAYER_CH_CVT_DEST=2
CONFIG_AUDIO_SIMPLE_PLAYER_RESAMPLE_DEST_RATE=48000
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_RESAMPLE_EN=y
# Disable unused codecs
# Note: ESP_AUDIO_CODEC_DECODER_* symbols removed — not available in IDF v6.x

# WiFi (ESP32-C6 over SDIO via esp_wifi_remote + esp_hosted)
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
# ESP-Hosted: SDIO transport to C6
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_PRIV_SDIO_OPTION=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_SLOT=1
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
# SDIO pins (matches Waveshare P4 board: P4↔C6)
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
# Optimization — disable RX streaming to prevent DMA exhaustion (issue #184)
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_NONE is not set
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE is not set
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=5
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=5
# Note: ESP_HOSTED_MEMPOOL_PREFER_SPIRAM removed — superseded by SPIRAM_TRY_ALLOCATE_WIFI_LWIP in IDF v6.x
# Allocate WiFi/LWIP from PSRAM to save SRAM.
# In IDF v6.x, this also covers DMA-capable allocations (SPIRAM_TRY_ALLOCATE_DMA_BUFFER was removed).
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Lower threshold for internal-only allocation: only tiny chunks (<4KB) go to internal SRAM.
# LWIP pbufs (~1.5KB) and other small WiFi buffers will go to PSRAM, saving ~20-30KB internal SRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# C6 reset
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_RESET_DELAY_MS=1500
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
# Disable TWT features (not compatible with IDF v6.x WiFi headers)
# CONFIG_ESP_HOSTED_ENABLE_ITWT is not set
# Enable MIPI CSI backup buffer (reduces DMA pressure, matches reference)
# CONFIG_ESP_VIDEO_DISABLE_MIPI_CSI_DRIVER_BACKUP_BUFFER is not set
# LWIP TCP — reduced from 65535/22 to save ~30KB internal SRAM (pbuf headers).
# 32KB TCP window still provides good throughput for MJPEG stream + file download.
# Keep MAX_SOCKETS=22 for future features (MQTT, WebSocket, OTA, etc.).
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_MAX_SOCKETS=22

CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y

# Video (esp_video V4L2 framework for camera streaming)
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_EXAMPLE_ENABLE_MIPI_CSI_CAM_SENSOR=y
CONFIG_EXAMPLE_SCCB_I2C_INIT_BY_APP=y
CONFIG_EXAMPLE_SCCB_I2C_PORT_INIT_BY_APP=0
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_PORT=0
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_FREQ=100000
CONFIG_EXAMPLE_JPEG_COMPRESSION_QUALITY=80
CONFIG_EXAMPLE_SELECT_JPEG_HW_DRIVER=y
CONFIG_EXAMPLE_CAMERA_VIDEO_BUFFER_NUMBER=2
CONFIG_EXAMPLE_HTTP_PART_BOUNDARY="123456789000000000000987654321"
CONFIG_EXAMPLE_MDNS_INSTANCE="web-cam"
CONFIG_EXAMPLE_MDNS_HOST_NAME="esp-web"
CONFIG_EXAMPLE_SELECT_CUSTOMIZED_DEV_BOARD=y

# ULog
CONFIG_ULOG_ENABLE=y
